---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TemporaryChangesOutOfDate
source: html/fd0b9e4f-daa1-c1a4-2104-a2384c4e3fe0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.TemporaryChangesOutOfDate Property

You must Reload Latest before editing the element. Changes will be temporary, and will not be saved.

## Syntax (C#)
```csharp
public static FailureDefinitionId TemporaryChangesOutOfDate { get; }
```